app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? AND "songs"."artist_id" = ?  ORDER BY "songs"."id" ASC LIMIT 1  [["id", 1234], ["artist_id", 1]]
---
  def edit
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.nil?
        redirect_to artists_path, alert: 'Artist not found'
      else
        @song = Song.where(id: params[:id], artist_id: params[:artist_id]).first